app/controllers/boards_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    @boards = current_user.boards.order("created_at DESC")

INSERT INTO "boards" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "Football"], ["created_at", "2017-07-11 11:48:46.829901"], ["updated_at", "2017-07-11 11:48:46.829901"], ["user_id", 1]]
---
  def create
    @board = current_user.boards.build(board_params)
    if @board.save

UPDATE "boards" SET "name" = ?, "updated_at" = ? WHERE "boards"."id" = ?  [["name", "Footballlllll"], ["updated_at", "2017-07-12 04:31:21.577574"], ["id", 1]]
---
  def update
    if @board.update(board_params)

SELECT "pins".* FROM "pins" WHERE "pins"."board_id" = ? ORDER BY created_at DESC  [["board_id", 1]]
---
  def show
    @pins = @board.pins.order("created_at DESC")

DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 2]]
---
  def destroy
    @board.destroy

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_pin
      @board = Board.find(params[:id])