app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC
---
  def index
    @pins = Pin.all.order("created_at DESC")

INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Testing after devise"], ["description", "sdfsdgjsn"], ["created_at", "2017-07-10 12:21:55.001623"], ["updated_at", "2017-07-10 12:21:55.001623"], ["user_id", 1]]
---
  def create
    # render plain: params.inspect
    @pin = current_user.pins.build(pin_params)
    if !params[:pin][:url].empty?
        @pin.data_from_url(@pin.url)
    end
    if @pin.save

UPDATE "pins" SET "url" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["url", "https://github.com/trending/ruby"], ["updated_at", "2017-07-12 08:03:26.557680"], ["id", 19]]
---
  def update
    if @pin.update(pin_params)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "url", "board_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def add_pin
    # render plain: params.inspect
    pin = Pin.find(params[:pin_id])
    @new_pin = Pin.new
    @new_pin.title = params[:title]
    @new_pin.description = params[:description]
    @new_pin.image = pin.image
    @new_pin.url = pin.url
    @new_pin.user = current_user
    @new_pin.board_id = params[:board_id].to_i
    # render plain: @new_pin.inspect
    if @new_pin.save